<?php

namespace App\Http\Controllers;
use Illuminate\Support\Str;
use Illuminate\Http\Request;

class TranslitController extends Controller
{
               public function translit(Request $request)
        {
            
$converterTo_en = ['а' => 'a', 'А' => 'A','б' => 'b', 'Б' => 'B','в' => 'v', 'В' => 'V','г' => 'g',
 'Г' =>'G','д' => 'd', 'Д' => 'D','е' => 'e', 'Е' => 'E','ё' => 'yo', 'Ё' => 'Yo','ж' =>'j','Ж' => 'J',
 'з' => 'z', 'З' => 'Z','и' => 'i', 'И' => 'I','й' => 'y','Й' => 'Y','к' => 'k', 'К' => 'K','л' => 'l',
 'Л' => 'L','м' => 'm', 'М' => 'M','н' => 'n', 'Н' => 'N','о' => 'o', 'О' => 'O','п' => 'p', 'П' =>'P',
 'р' => 'r', 'Р' => 'R','с' => 's', 'С' => 'S','т' => 't', 'Т' => 'T','у' => 'u','У' => 'U','ф' => 'f',
 'Ф' => 'F','х' => 'x','Х' => 'X','ц' => 's','Ц' => 'S','ч' => 'ch','Ч' =>'Ch','ш' => 'sh','Ш' => 'Sh',
 'ъ' => 'ʼ', 'Ъ' => 'ʼ', 'ь' => '', 'Ь' => '','э' => 'e','Э' => 'E','ю' => 'yu','Ю' =>'Yu','я' => 'ya',
 'Я' => 'Ya','ў' => 'oʻ', 'Ў' => 'Oʻ', 'қ' => 'q', 'Қ' => 'Q','ғ' => 'gʻ', 'Ғ' => 'Gʻ', 'ҳ' => 'h', 'Ҳ' => 'H',];
$converterTo_ru =[
    'a' => 'а', 'A' => 'А','b' => 'б', 'B' => 'Б','d' => 'д', 'D' => 'Д','e' => 'е', 'E' => 'Е',
        'f' => 'ф', 'F' => 'Ф','g' => 'г', 'G' => 'Г','h' => 'ҳ', 'H' => 'Ҳ','i' => 'и', 'I' => 'И',
        'j' => 'ж', 'J' => 'Ж','k' => 'к', 'K' => 'К','l' => 'л', 'L' => 'Л','m' => 'м', 'M' => 'М',
        'n' => 'н', 'N' => 'Н','o' => 'о', 'O' => 'О','p' => 'п', 'P' => 'П','q' => 'қ', 'Q' => 'Қ',
        'r' => 'р', 'R' => 'Р','s' => 'с', 'S' => 'С','t' => 'т', 'T' => 'Т','u' => 'у', 'U' => 'У',
        'v' => 'в', 'V' => 'В','x' => 'х', 'X' => 'Х','y' =>'й','Y' =>'Й','z'=>'з','Z' =>'З','ʼ'=>'ъ'
            ];


// в переменны $chr_en указываем латинский алфавит для далнейшего сравнения с введенным текстом
            $chr_en = "a-zA-Z0-9\s`~!@#$%^&*()_+-={}|:;<>?,.\/\"\'\\\[\]";
// получает из вюшки введеный текст через title и записывает в переменную $text
            $text = $request->input('title');
            $text = str_replace('ʻ', '‘', $text);
// проверяет если  $text пустой возврашает null
           
// проверяет если английские буквы в $text
            if (preg_match("/^[$chr_en]+$/", $text)) {
// если $text содержит английские буквы конвертирует в килилицу           
            $result = strtr($text, $converterTo_ru);
          //  $result = Str::slug($text, ' ', 'ru', );

        } else { 

// иначи конвертирует в латиницу            
            $result = strtr($text, $converterTo_en);

            }
            $text =$result;
// возврашает резултат в вьюшку var_dump($text);
            return view('transtext',compact('text') );

           } 

}

   

     
